###############################################################################
# Created by write_sdc
###############################################################################
current_design SPI_Master_With_Multi_CS
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name i_Clk -period 10.0000 [get_ports {i_Clk}]
set_clock_transition 0.1500 [get_clocks {i_Clk}]
set_clock_uncertainty 0.2500 i_Clk
set_propagated_clock [get_clocks {i_Clk}]
set_input_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {i_Rst_L}]
set_input_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {i_SPI_MISO}]
set_input_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {i_Slave_Select[0]}]
set_input_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {i_Slave_Select[1]}]
set_input_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {i_TX_Byte[0]}]
set_input_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {i_TX_Byte[1]}]
set_input_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {i_TX_Byte[2]}]
set_input_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {i_TX_Byte[3]}]
set_input_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {i_TX_Byte[4]}]
set_input_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {i_TX_Byte[5]}]
set_input_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {i_TX_Byte[6]}]
set_input_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {i_TX_Byte[7]}]
set_input_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {i_TX_Count[0]}]
set_input_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {i_TX_Count[1]}]
set_input_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {i_TX_DV}]
set_output_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {o_RX_Byte[0]}]
set_output_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {o_RX_Byte[1]}]
set_output_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {o_RX_Byte[2]}]
set_output_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {o_RX_Byte[3]}]
set_output_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {o_RX_Byte[4]}]
set_output_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {o_RX_Byte[5]}]
set_output_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {o_RX_Byte[6]}]
set_output_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {o_RX_Byte[7]}]
set_output_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {o_RX_Count[0]}]
set_output_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {o_RX_Count[1]}]
set_output_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {o_RX_DV}]
set_output_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {o_SPI_CS[0]}]
set_output_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {o_SPI_CS[1]}]
set_output_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {o_SPI_CS[2]}]
set_output_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {o_SPI_CS[3]}]
set_output_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {o_SPI_Clk}]
set_output_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {o_SPI_MOSI}]
set_output_delay 2.0000 -clock [get_clocks {i_Clk}] -add_delay [get_ports {o_TX_Ready}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {o_RX_DV}]
set_load -pin_load 0.0334 [get_ports {o_SPI_Clk}]
set_load -pin_load 0.0334 [get_ports {o_SPI_MOSI}]
set_load -pin_load 0.0334 [get_ports {o_TX_Ready}]
set_load -pin_load 0.0334 [get_ports {o_RX_Byte[7]}]
set_load -pin_load 0.0334 [get_ports {o_RX_Byte[6]}]
set_load -pin_load 0.0334 [get_ports {o_RX_Byte[5]}]
set_load -pin_load 0.0334 [get_ports {o_RX_Byte[4]}]
set_load -pin_load 0.0334 [get_ports {o_RX_Byte[3]}]
set_load -pin_load 0.0334 [get_ports {o_RX_Byte[2]}]
set_load -pin_load 0.0334 [get_ports {o_RX_Byte[1]}]
set_load -pin_load 0.0334 [get_ports {o_RX_Byte[0]}]
set_load -pin_load 0.0334 [get_ports {o_RX_Count[1]}]
set_load -pin_load 0.0334 [get_ports {o_RX_Count[0]}]
set_load -pin_load 0.0334 [get_ports {o_SPI_CS[3]}]
set_load -pin_load 0.0334 [get_ports {o_SPI_CS[2]}]
set_load -pin_load 0.0334 [get_ports {o_SPI_CS[1]}]
set_load -pin_load 0.0334 [get_ports {o_SPI_CS[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_Clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_Rst_L}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_SPI_MISO}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_TX_DV}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_Slave_Select[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_Slave_Select[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_TX_Byte[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_TX_Byte[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_TX_Byte[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_TX_Byte[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_TX_Byte[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_TX_Byte[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_TX_Byte[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_TX_Byte[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_TX_Count[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_TX_Count[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_capacitance 0.2000 [current_design]
set_max_fanout 10.0000 [current_design]
